In [1]:
import pandas as pd

### PyBank

In [2]:
# import csv file
data = pd.read_csv("budget_data.csv")
data.head()

     Date  Profit/Losses
0  Jan-10        1088983
1  Feb-10        -354534
2  Mar-10         276622
3  Apr-10        -728133
4  May-10         852993

In [3]:
# The total number of months included in the dataset
total_months = data.Date.value_counts().sum()

In [4]:
print('Total months:',total_months )

Total months: 86

In [5]:
# The net total amount of "Profit/Losses" over the entire period
net_total = data.iloc[:,1].sum()

In [6]:
print('Total : $',net_total)

Total : $ 22564198

In [7]:
# The changes in "Profit/Losses" over the entire period, and then the average of those changes (Average change)
data1 = data.iloc[:,1]
change = data1.diff()
avg_change = change.mean()
print('Average Change:$',avg_change)

Average Change:$ -8311.105882352942

In [8]:
# The greatest increase in profits (date and amount) over the entire period
max_diff = change.max()
print('Greatest Increase in Profits:$',max_diff)

Greatest Increase in Profits:$ 1862002.0

In [9]:
# The greatest decrease in profits (date and amount) over the entire period
min_diff = change.min()
print('Greatest Decrease in Profits:$',min_diff)

Greatest Decrease in Profits:$ -1825558.0

### PyPoll

In [10]:
# import csv file
data = pd.read_csv("election_data.csv")
data.head()

   Ballot ID     County                Candidate
0    1323913  Jefferson  Charles Casper Stockham
1    1005842  Jefferson  Charles Casper Stockham
2    1880345  Jefferson  Charles Casper Stockham
3    1600337  Jefferson  Charles Casper Stockham
4    1835994  Jefferson  Charles Casper Stockham

In [11]:
# The total number of votes cast
total_votes = data.iloc[:,0].value_counts().sum()
print('Total votes:',total_votes )

Total votes: 369711

In [12]:
# A complete list of candidates who received votes
data.Candidate.value_counts()

Diana DeGette              272892
Charles Casper Stockham     85213
Raymon Anthony Doane        11606
Name: Candidate, dtype: int64

In [13]:
votes_data = {'Candidate':['Diana DeGette','Charles Casper Stockham','Raymon Anthony Doane'], 'Votes': [272892,85213,11606]}
data1 = pd.DataFrame(votes_data)
data1

                 Candidate   Votes
0            Diana DeGette  272892
1  Charles Casper Stockham   85213
2     Raymon Anthony Doane   11606

In [14]:
# The percentage of votes each candidate won
total = data1.Votes.sum()
data1['Percentage'] = (data1['Votes'] / total) * 100
data1

                 Candidate   Votes  Percentage
0            Diana DeGette  272892   73.812248
1  Charles Casper Stockham   85213   23.048543
2     Raymon Anthony Doane   11606    3.139209

In [15]:
data1.iloc[0,0]

'Diana DeGette'

/Users/temitopeajose-adeogun/Desktop/Module Challenges/Module_3_Challenge

                 Candidate   Votes  Percentage
0            Diana DeGette  272892   73.812248
1  Charles Casper Stockham   85213   23.048543
2     Raymon Anthony Doane   11606    3.139209